[
  {
    "section_key": "gen_1",
    "title": "Gen 1 Quirks",
    "icon": "trending-up",
    "order": 1,
    "subsections": [
      {
        "subtitle": "",
        "content": "Generation 1 is... well, it’s \"Generation Fun,\" and there are a lot of broken mechanics we need to talk about."
      },
      {
        "subtitle": "The Badge Boost Glitch:",
        "content": "Say it with me, the Badge Boost Glitch. In this generation, when we get a badge, it boosts a specific stat by 12.5%. However, every time a stat is modified in battle—whether we use Agility or the opponent hits us with Leer—the game mistakenly reapplies every badge boost we’ve earned to our stats again,. This stacks, allowing us to become incredibly powerful. The catch? These glitchy boosts vanish the moment we level up"
      },
      {
        "subtitle": "Level Up Groups",
        "content": "We need to talk about experience, because not all Pokémon are created equal. In Generation 1, every Pokémon falls into one of four \"Level Up Groups\" that determine how much experience they need to hit the next level,.\n• The Slow Group: This is the worst one for us. It includes the legendary birds and Mewtwo, which makes sense, but for some reason, it also includes random Pokémon like Growlithe, Poliwag, Staryu, and Exeggcute,,,. It takes forever to level these guys up, meaning we are almost always under-leveled for major battles, forcing us to grind way more than we’d like,.\n• Medium Slow: This is where the starters live. Deceptively, this is actually the fastest group in the very early game, which is why Bulbasaur and Squirtle level up so nicely for Brock,.\n• Fast: You’d think the \"Fast\" group would be the best, but because of the way the math works, they actually level up slower than the Medium Slow group until around Level 6 or 7. So, using a \"Fast\" Pokémon like Clefairy or Jigglypuff against Brock can actually be a bit of a slog at the very beginning,."
      },
      {
        "subtitle": "Gen 1 Miss:",
        "content": "Due to a programming error, moves with 100% accuracy actually have a 1 in 256 chance to miss. It happens at the worst times"
      },
      {
        "subtitle": "Critical Hits",
        "content": "In Gen 1, critical hit ratio is based on a Pokémon's base speed. Fast Pokémon like Persian crit constantly, while slow ones like Slowpoke rarely do. Crucially, critical hits ignore all stat changes, including our own boosts. So, if we set up three Swords Dances and then get a crit, we actually do less damage than a non-crit"
      },
      {
        "subtitle": " \"Good\" AI:",
        "content": "Trainers like Lance have \"Good AI,\" which means they are programmed to use moves that are super effective against our typing. However, the AI only looks at type, not damage. That’s why Lance’s Dragonair will spam Agility (a Psychic-type move) against our Poison-types like Gengar or Weezing, because it thinks Psychic is super effective, even though Agility does no damage."
      },
      {
        "subtitle": "",
        "content": ""
      }
    ],
    "id": "6984b4e509736bab1f47dcd0",
    "created_date": "2026-02-05T15:19:01.498000",
    "updated_date": "2026-02-05T15:26:03.820000",
    "created_by_id": "6968d9b33bd7615d4854fd8b",
    "created_by": "nadavatar@gmail.com",
    "is_sample": false
  },
  {
    "section_key": "the_rules",
    "title": "THE RULES",
    "icon": "book-open",
    "order": 0,
    "subsections": [
      {
        "content": "When we start these challenges, we have a specific set of rules to keep things interesting and consistent.",
        "subtitle": "Intro"
      },
      {
        "content": "We are only allowed to use one specific Pokémon in battle. We catch other Pokémon, usually a Paras, a Lapras, and a flier like Pidgey or Spearow, but they are \"HM Pokemon\" used solely for moves like Cut, Fly, and Surf to get around the region.",
        "subtitle": "Solo Run"
      },
      {
        "content": "We cannot use items like Potions or X Attacks during trainer battles. We can use them outside of battle to heal, but once the fight starts, we’re on our own.",
        "subtitle": "No Items in Battle"
      },
      {
        "content": "To ensure we have a consistent strategy rather than just getting lucky once, we do not save the game in between Elite Four members,. We have to beat the them in one go.",
        "subtitle": "No Saving Between Elite Four"
      },
      {
        "content": "We generally play glitchless, meaning no wall-clipping or item duplication. However, we do treat certain mechanics, like the Badge Boost Glitch, as unintended features rather than game-breaking bugs",
        "subtitle": "No Glitches (Mostly)"
      },
      {
        "content": "We have an unofficial rule where we ban the use of evasion moves like Double Team. While every Pokémon can learn it and it contributes to the badge boost glitch, it makes the runs boring to watch and removes the challenge by making us untouchable, so we just don't use it",
        "subtitle": "No Evasion Moves"
      }
    ],
    "id": "6984a60af14948135615fc53",
    "created_date": "2026-02-05T14:15:38.360000",
    "updated_date": "2026-02-05T14:15:38.360000",
    "created_by_id": "6968d9b33bd7615d4854fd8b",
    "created_by": "nadavatar@gmail.com",
    "is_sample": false
  }
]